app/controllers/posts_controller.rb

INSERT INTO "posts" ("author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author", "Gigi"], ["content", "再也不要这样的日夜颠倒的生活！"], ["created_at", "2014-10-29 04:23:38.707419"], ["updated_at", "2014-10-29 04:23:38.707419"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save